chat_system_2053836080_actor_description=Redbeard. Pirate.
chat_system_2053836080_snap_0_question=^?^Ahoy thar! What good wind brought you to the Islands, me matey? Don't pass by, talk to an old pirate. Any news from the big land?
chat_system_2053836080_snap_0_answer_0=^?^Hmm. Can't you tell at once that I'm new here?
chat_system_2053836080_snap_2_question=^?^Oh, my laddie, I was born on these islands, and I'll be living here my whole life until I die. I know what kind of impression this ground will leave on a man.
chat_system_2053836080_snap_2_answer_0=^?^Your whole life? So you must know a great many people here. Maybe you'll tell me where I can find Lucky James, then?
chat_system_2053836080_snap_2_answer_1=^?^Aren't you the famous Redbeard the Pirate who I'm looking for?
chat_system_2053836080_snap_2_answer_2=^?^I doubt I'll ever understand you.
chat_system_2053836080_snap_2_answer_3=^?^Maybe I can buy something interesting from you? I certainly wouldn't mind hiring a couple mercenaries as well.
chat_system_2053836080_snap_3_question=^?^Lucky? Oh, his luck is over, son, mark my words. Of course, I know you can say we're neighbors in that, heh-heh.<br>When the governor got him in a tight corner, he ducked out of sight, strike him dead... Many, yes, many people would like to find him and... have a little chat with the scoundrel.<br>I moved to this island because I know that scoundrel is hiding here! His mines are here, he makes a living off the precious ores and gemstones. He's hiding in those mines, I just know it; he has secret passes and all sorts of shady business.
chat_system_2053836080_snap_3_answer_0=^?^So, you say he's hiding here, in the mines. Thank you!
chat_system_2053836080_snap_1_question=^?^Wait! Just look at this fiery young man. How are you planning to get by the guards? Or do you think that nobody knows about these mines? There's gold, gems, plus Lucky's secret den down there. You can't get there just like that. Plus, you'll need to know the secret word. The password.<br>Let's do it like this - you help me and I help you. You'll give the black mark to Lucky from me, and I'll tell you the secret word so that the guards will let you in. Do we have a deal?
chat_system_2053836080_snap_1_answer_0=^?^No. I don't want to meddle in you pirates' shady dealings. I'll try to get into the mines myself.
chat_system_2053836080_snap_1_answer_1=^?^Ok! Give me that black mark.
chat_system_2053836080_snap_black_mark_question=^?^Okay, here's how you can get in. You should say that you brought some food, and they'll ask you for the password. Then you tell them the password is "Shrimp." I've been keeping an eye on those mines for a long time, and I've managed to find out a few things.
chat_system_2053836080_snap_black_mark_answer_0=^?^Wish me good luck.
chat_system_2053836080_snap_4_question=^?^I don't know who you're looking for, or why, but I'm called Redbeard more often than by name.<br>First tell me - what do you need from him? Maybe I'm the guy you're looking for.
chat_system_2053836080_snap_4_answer_0=^?^I was told that you might know how to find Lucky James.
chat_system_2053836080_snap_4_answer_1=^?^He owes me something. So I'm looking for him to collect the debt.
chat_system_2053836080_snap_5_question=^?^A debt, you say? [s]The pirate scrunches up his eyes:[/s]<br>I don't have any problems with me memory. I remember everybody I owe money to, and everybody who owes me. And your face I don't seem to remember.
chat_system_2053836080_snap_5_answer_0=^?^I'm sorry for the silly joke. I'm looking for Lucky James. I was told that you can tell me where I can find him.
chat_system_2053836080_snap_8_question=^?^Look, buddy. I saw you wandering around Lucky's mines. Would you do a small favor for me?<br>Could you bring this black mark to James? He's an old friend of mine. Ok?
chat_system_2053836080_snap_8_answer_0=^?^Ok, give it to me, I'll deliver it.
chat_system_2053836080_snap_8_answer_1=^?^No. I don't want to meddle into your shady dealings.
chat_system_2053836080_snap_10_question=^?^Ok. I'll look for somebody else. Look, if you need to hire some tough mercenaries - you just ask me.
chat_system_2053836080_snap_10_answer_0=^?^Ok, I'll remember.
chat_system_2053836080_snap_9_question=^?^Of course! Come back whenever you like. I'll always be glad to see you. Now that some daredevil has killed James, I'm completely bored.
chat_system_2053836080_snap_9_answer_0=^?^Show me what you have.
chat_system_2053836080_snap_6_question=^?^So, have you managed to get to Lucky's refuge? I saw you trying to get into his mines. Let's do it this way: if you agree to give him the black mark for me, I'll tell you the password.
chat_system_2053836080_snap_6_answer_0=^?^Ok, it's a deal. Give me the black mark.
chat_system_2053836080_snap_6_answer_1=^?^That's ok; I haven't tried everything yet.
chat_system_2053836080_snap_7_question=^?^Ok, good luck and fair wind to you, ha-ha. Call on me when you get tired of trying to blow your own sails. You remember my terms.
chat_system_2053836080_snap_7_answer_0=^?^You can wait for the cows to come home.
